function конвертувати(одиниця, значення) {
    switch (одиниця) {
        case "км":
            const метри = значення * 1000;
            console.log(`${значення} км це ${метри} м.`);
            break;
        case "год":
            const хвилини = значення * 60;
            console.log(`${значення} год це ${хвилини} хв.`);
            break;
        case "кг":
            const грами = значення * 1000;
            console.log(`${значення} кг це ${грами} г.`);
            break;
            default:
            console.log("Невідома одиниця виміру");
    }
}

// Приклади викликів функції для різних одиниць виміру
конвертувати("км", 14.7);
конвертувати("год", 3);
конвертувати("кг", 4.8);
